[{
  "time": "2022-12-29",
  "img": "https://static1.4everland.org/img/log/2022-12-29.png",
  "title": "New Optimization",
  "lines": ["1. Hosting cli support for CID deployment.", "2. Hosting support for setting ENS binding project cid.", "3. Support setting the index page of the gateway domain in dedicated gateway.", "4. Add a new origins whitelist feature in the dedicated gateway."]
},
{
  "time": "2022-12-14",
  "img": "https://static1.4everland.org/img/log/2022-12-14.png",
  "title": "OKX Wallet integration is live!",
  "lines": []
},
{
  "time": "2022-12-08",
  "img": "https://static1.4everland.org/img/log/2022-12-08.png",
  "title": "Vouchers and cross-chain deposit features are live!  The following new features were included in this release:",
  "lines": ["1. Support creating resource vouchers and credit in the backend management.", "2. Support redeeming and using resource vouchers and credit in Dashboard.", "3. Support ETH and BSC multi-chain deposit in Resource Hub.", "4. Add AR storage reward for sharing on Twitter in Reward Hub.", "5. Update sharing Tweet.", "6. Solana RPC is now live!"]
},
{
  "time": "2022-11-04",
  "img": "https://static1.4everland.org/img/log/2022-11-04.png",
  "title": "IPNS Manager is now live!",
  "lines": ["1. Support creating IPNS based on CID.", "2. Support to generate empty IPNS.", "3. Support creating IPNS based on ENS domain name.", "4. Support binding ENS domain name to IPNS.", "5. Support generating Auth Token.", "6. Support IPNS Manager API."]
},
{
  "time": "2022-10-31",
  "img": "https://static1.4everland.org/img/log/2022-10-31.jpg",
  "title": "Dedicated gateway is live!",
  "lines": ["1. Deposit to unlock this service.", "2. Support for creating restricted or open gateways.", "3. Support gateaway custom domain name. ", "4. Add gateway statistics and other features. "]
},
{
  "time": "2022-10-24",
  "img": "https://static1.4everland.org/img/log/2022-10-24.png",
  "title": "Reward Hub is live!",
  "lines": ["1. oin 4EVERLAND Discord to get 1GB IPFS storage.", "2. Follow @4everland_org on Twitter to get 1GB IPFS storage.", "3. Subscribe to get 1GB IPFS storage. ", "4. Deposit 5U and invite 3 new users to get 5GB IPFS storage each. "]
},
{
  "time": "2022-09-29",
  "img": "https://static1.4everland.org/img/log/2022-9-29.png",
  "title": "Add and improve some features.",
  "lines": ["1. Support CID upload in Bucket.", "2. Reduce Bucket upload and delete panel. ", "3. Add Snapshots list and its feature in Bucket folder.", "4. Add redirect configuration and edit function in Hosting domain configuration.", "5. Optimize the Deploy hook function in Hosting."]
},
{
  "time": "2022-09-01",
  "img": "https://static1.4everland.org/img/log/2022-9-1.png",
  "title": "Ar Hosting is live!",
  "lines": ["1. Support Ar Hosting deployment.", "2. Deployment consumes Ar and resource settlement.", "3. Add a pop-up reminder for new registered users.", "4. Modify the style of the airdrop pop-up. ", "5. Add two kinds of pop-up to get 5G IPFS storage for sharing tweets. "]
},
{
  "time": "2022-08-25",
  "img": "https://static1.4everland.org/img/log/2022-8-25.png",
  "title": "Resource Center is live!",
  "lines": ["1. Revise the Resource Center's UI including its modules for purchase, deposit, withdraw, and billing.", "2. Display a circular graph showing the distribution of resources consumed and purchased in your account.", "3. Add the email alert feature for insufficient resources.", "4. Add custom purchases of various resources using wallet balance.", "5. Split single-chain and multi-chain bill payments, and add the airdrop record function.  ", "6. Add Pricing docs."]
},
{
  "time": "2022-08-18",
  "img": "https://static1.4everland.org/img/log/2022-8-18.png",
  "title": "IC Hosting is live!",
  "lines": ["1. Support IC Hosting deployment.", "2. Support IC project custom domain name.", "3. Adjust the display of IC project.", "4. Add IC logo and status to the project list."]
},
{
  "time": "2022-08-08",
  "img": "https://static1.4everland.org/img/log/2022-8-8.png",
  "title": "Add and improve some features.",
  "lines": ["1. Revise the style of Dashboard's UI.", "2. Revise Overview style.", "3. Adjust the style of Hosting list.", "4. Add a settings button and adjust the size of the statistics field in the Hosting project info profile.", "5. Optimize Hosting domain binding list fields.", "6. Add IPFS Hash field to Hosting project list. ", "7. Display a pop-up reminder when there is an error in the Hosting domain binding list.", "8. The project preview opens by default on the Hosting project list page, no need to click manually.", "9. Add IPNS display to Hosting project overview page.", "10. Add rollback function in Hosting Deployments.", "11. Optimize Hosting Domain list, add ENS and SNS domain switching function.", "12. Add Preview Deployments in Hosting Project Overview.", "13. Optimize the Hosting statistics list field to display today's and total relevant data, click on the project name to visit the project website, and click on the current row to access project data details.", "14. No items will appear in the Hosting project list, so the first page will be cancelled and the current page will be taken directly to the step of creating a project.  ", "15. Add search function in Bucket AR History.", "16. Show Bucket file details directly on current page.", "17. Add the name of each public chain in the login page.", "18. Adjust the sharing page on your personal account.  ", "19. Optimize feedback pop-up pages for personal account and add question types field.", "20. Adjust personal account, change Collection and Referral name position.", "21. Add social platforms to menu including twitter, medium, Discod, and Telegram.", "22. Optimize and improve some details. "]
},
{
  "time": "2022-05-11",
  "img": "https://static1.4everland.org/img/log/2022-5-11.png",
  "title": "Added some new features",
  "lines": [
    "Support fragment management.",
    "Support folder upload.",
    "Optimize uploading process, add pause, cancel, and delete features.",
    "Add scanning feature to archive the files to be uploaded.",
    "Add upload list to manage the uploading process.",
    "Add delete list to manage the deleted process."
  ]
},
{
  "time": "2022-04-18",
  "img": "https://static1.4everland.org/img/log/2022-4-18.png",
  "video": "https://static1.4everland.org/video/2022-4-18.mp4",
  "title": "Added some new features",
  "lines": [
    "Support SNS domain.",
    "You can access 4sol.xyz after the domain name bound successfully",
    "Provide exclusive SNS gateway.",
    "Support IPNS."
  ]
},
{
  "time": "2022-04-07",
  "img": "https://static1.4everland.org/img/log/2022-4-7.jpg",
  "title": "4EVERLAND new Dashboard is officially launched!",
  "lines": [
    "Redesign the official website's UI and merge Hosting & Bucket display page.",
    "Add MetaMask login in Hosting and Bucket. ",
    "Keep the original GitHub login, but users can login with wallet after connecting a new wallet account.",
    "Bucket and Hosting Docs are integrated into one.",
    "Adjust the secondary modules.",
    "Optimize the Hosting project display style and adjust the deployment process."
  ]
},
{
  "time": "2022-03-11",
  "img": "https://docs-images.4everland.store/bucketchangelog.gif",
  "title": "Add AR storage to 4EVERLAND Bucket",
  "lines": [
    "Added the function to automatically sync to AR when creating a Bucket",
    "Add the AR synchronization function for a particular file.",
    "Added AR History module.",
    "Add AR-related fields to file info.",
    "Modified the display style of the remaining storage."
  ]
},
{
  "time": "2022-01-10",
  "img": "https://static1.4everland.org/img/log/2022-1-10.png",
  "title": "Added some new features",
  "lines": [
    "Support ENS and IPNS"
  ]
},
{
  "time": "2022-01-07",
  "img": "https://static1.4everland.org/img/log/2022-1-7.png",
  "title": "Improved some details of 4EVERLAND HOSTING",
  "lines": [
    "Optimized the custom pricing plan and its payment process ",
    "Fixed some known issues"
  ]
},
{
  "time": "2021-12-10",
  "img": "https://static1.4everland.org/img/log/2021-12-10.gif",
  "title": "We support the CLI now !",
  "lines": [
    "Hosting offers a command-line interface for the 4everland CLI, which enables you to deploy and manage projects with a set of commands. ",
    "Please check the following link to access  <a href='https://docs.hosting.4everland.org/cli/' target='_blank'>Docs-Cli</a>"
  ]
},
{
  "time": "2021-12-06",
  "img": "https://static1.4everland.org/img/log/2021-12-06.jpeg",
  "title": "We offered you pricing plans to subscribe.",
  "lines": [
    "Added pricing plan, you can subscribe it based on your specific needs.",
    "Offered four different versions: free, pro, business, and custom.",
    "Supported DAI, USDC, and USDT payment methods. "
  ]
},
{
  "time": "2021-12-06",
  "img": "https://static1.4everland.org/img/log/2021-12-06-2.jpeg",
  "title": "Modified the billing model and bill display page.",
  "lines": [
    "Billing statistics are modified to the three dimensions of bandwidth, storage, and build minutes. Users before the HOSTING beta release will have access to 100M bandwidth and 40G storage until December 31, 2021.",
    "Added payment record, you can view payment details.",
    "Added status reminder function. "
  ]
},
{
  "time": "2021-12-06",
  "img": "https://static1.4everland.org/img/log/2021-12-06-3.jpeg",
  "title": "Optimized statistics function.",
  "lines": [
    "Added the function to view new user retention rate by date filter.",
    "Added statistics modules of total requests, request by source, and request by county.",
    "The source statistics include: References, Browsers, Device types, Operating systems, Paths. "
  ]
},
{
  "time": "2021-10-25",
  "img": "https://static1.4everland.org/img/log/2021-10-25.jpeg",
  "title": "Published new functions in 4EVERLAND-HOSTING.",
  "lines": [
    "Published new gateway ",
    "Claim' button in First Landing page now available "
  ]
},
{
  "time": "2021-10-11",
  "img": "https://static1.4everland.org/img/log/2021-10-11.jpeg",
  "title": "More details in 4EVERLAND HOSTING have improved.",
  "lines": [
    "Set the corresponding browser title according to the page route ",
    "Added a prompt of A record or AAAA record conflict when adding a first-level domain name in the project settings"
  ]
},
{
  "time": "2021-9-27",
  "img": "https://static1.4everland.org/img/log/2021-9-27.jpeg",
  "title": "Improvements on the statistics page and breadcrumb navigation is added.",
  "lines": [
    "Breadcrumb navigation added on project details and build page",
    "Added refresh data button added on  the Statistics page ",
    "Optimized UI of the statistics page, added different colour for retention rate"
  ]
},
{
  "time": "2021-9-13",
  "img": "https://static1.4everland.org/img/log/2021-9-13.jpeg",
  "title": "Optimized the deployment process.",
  "lines": [
    "Optimized the construction process and added branch selection function",
    "Optimized the build process and increased the Deploy Hooks option",
    "Added commits history to the project details page, and specific commits can be selected for deployment"
  ]
},
{
  "time": "2021-9-6",
  "img": "https://static1.4everland.org/img/log/2021-9-6.jpeg",
  "title": "Intercom is now up. Now you can speak to us in no time and also we have optimized couples details such as import Git repository etc.",
  "lines": [
    "Optimized the Build command, scroll down for the default scripts in package.json",
    "Optimized Git repository search",
    "Optimized Git Repo import process and support branch selection ",
    "Set the Clone Flow page defaults to project name to the git name and added branch display",
    "Integrated Intercom"
  ]
},
{
  "time": "2021-8-31",
  "img": "https://static1.4everland.org/img/log/2021-8-31.jpg",
  "title": "We have done more functional support and detailed optimization for 4EVERLAND HOSTING, as follows:",
  "lines": [
    "Support multiple GitHub accounts login and also org Github accounts. ",
    "Enable search on Github projects and display in pages.",
    "Added project titles on the build page and with links direct to project details.",
    "Added the 'go to last line' button to return the bottom of the build logs. (This button shows the number of new build logs while building).",
    "Fixed no updates on output contents issue after rebuild.",
    "Updated default background image and changelog icon.",
    "Optimized line chart on the statistics page."
  ]
},
{
  "time": "2021-8-16",
  "img": "https://www.4everland.org/imgs/blogs/Hosting_Launch.png",
  "title": "4EVERLAND HOSTING is officially launched, you can deploy and host your website through 'HOSTING' with one click. The specific features are as follows.",
  "lines": [
    "Authorize login via github",
    "Connect to a github repository",
    "Select a framework or custom build command, output dir, root dir",
    "Add environment variables",
    "Execute the compilation, log view real-time build process",
    "Access to the build project website",
    "A new account to receive trial credits and view credit usage (40GB storage + unlimited flow)",
    "Support for project templates, clone any github repository, support for subfolders",
    "Access to any imported project to: check build history, statistics (PV/UV/retention), change compilation configuration, customize domain name, configure environment variables, configure webhooks, etc.",
    "Support for viewing Docs documentation",
    "Support for automated content risk identification and review services",
    "Support for Feedback and reporting features"
  ]
}
]